app/controllers/api/v1/scores_controller.rb

SELECT COUNT(*) FROM "scores" WHERE (lower(player) IN ('shahid'))
SELECT "scores".* FROM "scores" WHERE (lower(player) IN ('shahid')) ORDER BY time DESC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
INSERT INTO "scores" ("player", "score", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["player", "shahid"], ["score", 0], ["time", "2021-09-02 14:08:09.204000"], ["created_at", "2021-09-02 14:42:42.537302"], ["updated_at", "2021-09-02 14:42:42.537302"]]
SELECT "scores".* FROM "scores" WHERE (lower(player) IN ('shahid')) ORDER BY time DESC LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]
---
  def index
    begin
      if is_valid_rec?
        rec = []
        score = Score.search(params).page(@page).per(@size)
        pages  = pagination(score)
        score.map{|score| rec << {player: score.player, score: score.score, time: score.time}}

INSERT INTO "scores" ("player", "score", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["player", "Shahid"], ["score", 12], ["time", "2021-09-03 16:10:22"], ["created_at", "2021-09-03 16:10:38.373639"], ["updated_at", "2021-09-03 16:10:38.373639"]]
---
  def create
    begin
      score = Score.new(score_params)
      if score.valid?
        score.save

SELECT "scores".* FROM "scores" WHERE "scores"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "scores" WHERE "scores"."id" = $1  [["id", 5]]
---
  def destroy
    begin
      score = Score.find_by(id: params[:id])
      if score.present?
        if score.delete

SELECT AVG("scores"."score") FROM "scores" WHERE (lower(player) = 'shahid')
SELECT time, score FROM "scores" WHERE (lower(player) = 'shahid') ORDER BY score ASC LIMIT $1  [["LIMIT", 1]]
SELECT time, score FROM "scores" WHERE (lower(player) = 'shahid') ORDER BY score DESC LIMIT $1  [["LIMIT", 1]]
---
  def player_history
    if @score.present?
      missing_params = false
      res = {}
      case params[:score].downcase
      when "top"
        score = @score.max_score
        res = {score: score.first.score, time: score.first.time}
      when "low"
        score = @score.min_score
        res = {score: score.first.score, time: score.first.time}
      when "average"
        avrg = @score.average(:score)
        res = {score: avrg, time: @score.last.time}
      when "all"
        res = []
        @score.map{|score| res << {score: score.score, time: score.time}}

SELECT "scores".* FROM "scores" WHERE "scores"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def set_player_by_id
    @score = Score.find_by(id: params[:id])