app/models/score.rb

  def self.search(params)
    player, before, after, from_date, to_date  = params[:player], params[:before], params[:after], params[:from_date], params[:to_date]
    # Set query for all record
    score = Score.all

    # Filter by name
    if player.present?
      name = player.downcase.split(',')
      score = score.where("lower(player) IN (?)", name.collect(&:strip))
    end

    # Filter by before and after
    if before.present? && after.present?
      score = score.where("date(time) > ? AND date(time) < ?", after.to_date, before.to_date)
    elsif before.present?
      score = score.where("date(time) < ?", before.to_date)
    elsif after.present?
      score = score.where("date(time) > ?", after.to_date)
---
SELECT "scores".* FROM "scores" WHERE (lower(player) IN ('shahid'))